Repository: yaracena01/cisep-servicios-multiples
Catalog: cisep/Resources/Controllers/HomeController.*.resx
Languages: es

source: You can stop by our office and just use the contact form below for any questions and inquiries
es: Puede pasar por nuestra oficina y usar el formulario de contacto a continuación para cualquier pregunta o consulta.

source: Your email has been sent successfully.
es: Su correo ha sido enviado satisfactoriamente.

source: Your email has been sent successfully.1
es: Su correo ha sido enviado satisfactoriamente.

source: Your message
es: Su mensaje

source: Zoom Lens
es: Lentes de aumento
